{
	"@metadata": {
		"authors": [
			"Abijeet Patro",
			"Ajeje Brazorf",
			"Amire80",
			"Eihel",
			"Kuldeepburjbhalaike",
			"McDutchie",
			"Robby",
			"Verdy p"
		]
	},
	"name": "{{Doc-important|Don't write \"English\" in your language!}}\n\n'''Write the name of ''your'' language in its native script.'''\n\nCurrent language to which the string is being translated to.\n\nFor example, write \"français\" when translating to French, or \"Deutsch\" when translating to German.\n\n'''Important:''' Do not use your language’s word for “English”. Use the word that your language uses to refer to itself. If you translate this message to mean “English” in your language, your change will be reverted.",
	"error-title": "{{Identical|Error}}",
	"error-downloader-window-title": "Error text displayed when the ZIM file downloader failed to start on the local system.",
	"error-downloader-launch-message": "Error text displayed to elaborate on the effect of the downloader failure.",
	"error-launch-server-message": "Error text displayed when Kiwix server failed to launch.",
	"error-archive": "Error text displayed when the retrieving the archive of a ZIM file failed.",
	"open-zim": "Caption text for file explorer window used to choose a ZIM file.",
	"local-kiwix-server": "Describes a server hosted locally that contains the local kiwix library.",
	"random-article": "A randomly chosen article in a ZIM file.",
	"random-article-error": "Error text displayed when opening a random article in a ZIM file failed.",
	"home-page": "Return to the home or landing page of the ZIM file.",
	"main-menu": "Describes the menu that contains all user actions.",
	"print": "{{identical|Print}}",
	"print-page-error": "Error text displayed when printing the current web page into a file.",
	"new-tab": "Represents the action of opening a new, blank tab on the tab bar.",
	"close-tab": "Represents the action of closing a tab on the tab bar.",
	"close": "Represents the action of closing a displayed window.",
	"reopen-closed-tab": "Represents the action of reopen a tab that has just been closed.",
	"browse-library": "Represents the action of browsing the local kiwix library.",
	"open-file": "Represents the action of opening a file from the local file system.",
	"open-recent": "Represents the action of choosing to open a file from those recently opened.",
	"search-article": "Represents the action of Searching for a article in the current ZIM file.",
	"search-in-library": "Represents the action of Searching for a text in the local Kiwix library.",
	"find-in-page": "Represents the action of searching for a text in the current article/page.",
	"set-fullscreen": "Represents the action of setting this desktop application to fill the entire computer screen.",
	"quit-fullscreen": "Represents the action of setting this desktop application back to its original, non-fullscreen dimensions.",
	"table-of-content": "Describes the table of content of an article.",
	"add-bookmark": "Represents the action of adding a page as a bookmark",
	"remove-bookmark": "Represents the action of removing a page from the bookmarks",
	"reading-list": "Describes a list of bookmarked articles.",
	"reading-list-title": "Describes a list of bookmarked articles.",
	"zoom-in": "Represents the action of zooming into the article, making the article content appear larger.",
	"zoom-out": "Represents the action of zooming out of the article, making the article content appear smaller.",
	"zoom-reset": "Represents the action of resetting the article zoom, changing the article content size back to default",
	"help": "{{identical|Help}}",
	"feedback": "{{identical|Feedback}}",
	"report-a-bug": "Represents the action of reporting a bug in this desktop application.",
	"request-a-feature": "Represents the action of requesting a new feature in this desktop application.",
	"about-kiwix": "Describes the about page of Kiwix, containing information of the organization.",
	"donate-to-support-kiwix": "Represents the action of donating to support the Kiwix Organization.",
	"exit": "Represents the action of exiting the desktop application",
	"save-file-as-window-title": "Title text of the window prompting user to save as a new file.",
	"download-finished-message": "Text displayed when the download action has been completed",
	"file": "{{Identical|File}}",
	"edit": "{{Identical|Edit}}",
	"view": "{{Identical|View}}",
	"tools": "{{Identical|Tools}}",
	"window-title": "The title text displayed when the library browser is present",
	"search": "{{identical|Search}}",
	"browse-directory": "Represents the action of browsing the local file system for a directory.",
	"settings": "{{Identical|Settings}}",
	"back": "{{identical|Back}}",
	"forward": "{{Identical|Forward}}",
	"search-files": "Represents the action of searching online or locally for ZIM files.",
	"title": "{{identical|title}}",
	"size": "{{identical|size}}",
	"date": "{{identical|Date}}",
	"content-type": "Describes the type of contents available on a ZIM file, for example, text or pictures.",
	"reset-sort": "Represents the action of resetting the sorting of the items to default order.",
	"open": "{{Identical|Open}}",
	"delete": "{{identical|Delete}}",
	"download": "{{Identical|Download}}",
	"resume": "\"Resume\" here refers to continuing a task.",
	"pause": "{{identical|Pause}}",
	"cancel": "{{identical|Cancel}}",
	"apply": "{{identical|apply}}",
	"port-for-local-kiwix-server-setting": "Refers to the network port number on which the local Kiwix server will run.",
	"zoom-level-setting": "Describes the default zoom level of articles displayed on this desktop application.",
	"download-directory-setting": "Describes the directory in the file system where ZIM files will be downloaded to.",
	"monitor-directory-setting": "Describes the directory in the file system where we will monitor for ZIM file changes.",
	"reset": "{{Identical|reset}}",
	"clear": "\"Clear\" here refers to emptying something.",
	"browse": "{{Identical|Browse}}",
	"about-kiwix-desktop-title": "Describes the title of this desktop application",
	"about-kiwix-desktop-description": "Brief description of this desktop application.",
	"about-learn-more-about-kiwix": "Hyperlink text directing to more details about Kiwix.",
	"about-release-title": "Title text for the section on the release stages of this desktop application.",
	"about-source-code": "Describes the licensing of the source code used for this desktop application.",
	"about-version": "Describes the release version of this desktop application.",
	"about-reporting-problem-title": "Title text for the section for how to report a problem for this desktop applciation.",
	"about-report-issue": "Description of instructions on how to report an issue.",
	"about-report-issue-2": "Description of instructions on how to report an issue.",
	"about-libraries-title": "Title text for the section on what libraries are used in this desktop application.",
	"kiwix-server-running-message": "Text displayed when kiwix server has started running.",
	"kiwix-server-description": "Description text about capabilities of Kiwix server",
	"fullscreen-notification": "Notification Text displayed when the desktop application is set to fullscreen.",
	"online-files": "The ZIM files that can be found online.",
	"local-files": "The ZIM files that are stored locally.",
	"category": "{{Identical|Category}}",
	"language": "{{Identical|Language}}",
	"hide": "{{Identical|Hide}}",
	"open-in-browser": "Represents the action of opening a link in the native browser.",
	"start-kiwix-server": "Represents the action of starting the kiwix server.",
	"stop-kiwix-server": "Represents the action of stopping the running kiwix server.",
	"all": "{{Identical|All}}",
	"fulltext-search": "Represents the action of searching the text appearances in all the articles in a ZIM file.",
	"pictures": "{{identical|Picture}}",
	"videos": "{{identical|Video}}",
	"ftindex": "Text indicating that fulltext search is supported",
	"details": "A content type for ZIM files representing it has more than just an introduction.",
	"yes": "{{identical|yes}}",
	"no": "{{identical|no}}",
	"ok": "{{Identical|Ok}}",
	"no-filter": "No filter selected for searches.",
	"open-link-in-web-browser": "Ouvrir le lien dans le navigateur",
	"open-link-new-tab": "Represents the action of opening a hyperlink in an article in a new tab.",
	"download-dir-dialog-title": "A question to confirm the action to change the download directory.",
	"download-dir-dialog-msg": "Please note that <code><nowiki>{{DIRECTORY}}</nowiki></code> should be placed on a newline.",
	"invalid-port": "Error text displayed when the port selected is invalid in the local system.",
	"zim-open-fail-title": "Error title text for the situation when opening a file as a ZIM file failed.",
	"zim-open-fail-text": "Error description text for when opening a file as a ZIM file failed.",
	"monitor-dir-dialog-title": "\"Monitor\" means \"watch\" in this context. The monitor directory is monitored/watched for new ZIM files.",
	"monitor-dir-dialog-msg": "\"Monitor\" means \"watch\" in this context. The monitor directory is monitored/watched for new ZIM files.",
	"monitor-clear-dir-dialog-title": "\"Monitor\" means \"watch\" in this context. The monitor directory is monitored/watched for new ZIM files.",
	"path-was-copied": "Tooltip confirming that the download path from settings was copied.",
	"monitor-clear-dir-dialog-msg": "\"Monitor\" means \"watch\" in this context. The monitor directory is monitored/watched for new ZIM files.",
	"monitor-directory-tooltip": "Description text on what the monitor directory does.",
	"next-tab": "Represents the action of switching to the next tab with respect to the current tab.",
	"previous-tab": "Represents the action of switching to the previous tab with respect to the current tab.",
	"cancel-download": "Represents the action of cancelling an on-going download of a ZIM file.",
	"cancel-download-text": "A question to confirm the action to cancel the download of a ZIM file.",
	"delete-book": "Represents the action of deleting an existing ZIM file.",
	"delete-book-text": "A question to confirm the action to delete an existing ZIM file.",
	"download-storage-error": "Error title text displayed when something is wrong with the directory of storage for ZIM files",
	"download-storage-error-text": "Error description text for when something is wrong with the directory of storage for ZIM files.",
	"download-exceeds-max-file-size": "Error text for the case when the download size exceeds the maximum files size of the filesystem where the download is going to be saved. Reported before the download is started.",
	"download-dir-missing": "Error text displayed when it turns out that the download directory doesn't exist.",
	"download-dir-not-writable": "Error text displayed when files cannot be created/saved in the download directory due to permissions",
	"download-unavailable": "Error title text displayed when the downloading functionality is not available.",
	"download-unavailable-text": "Error description text displayed when the downloading functionality is not available.",
	"open-book": "\"Open\" is a imperative, not an adjective.",
	"download-book": "Represents the action of downloading a ZIM file book.",
	"pause-download": "Represents the action of pausing an on-going download of a ZIM file.",
	"resume-download": "Represents the action of resuming a paused download of a ZIM file.",
	"open-folder": "Represents the action of opening a folder in the file system.",
	"couldnt-open-location": "Error title text displayed when opening a folder in the file system failed.",
	"couldnt-open-location-text": "Error description text for when opening a folder in the file system failed.",
	"move-files-to-trash": "Represents the action of moving ZIM files to trash, similar to deleting them.",
	"move-files-to-trash-text": "Description text for the action of moving ZIM files to trash, similar to deleting them.",
	"perma-delete-files-text": "Description text for the action of permanently deleting ZIM files.",
	"clear-filter": "Represents the action of clearing the filters selected for a filter type.",
	"language-searcher-placeholder": "Placeholder text displayed to indicate the ZIM file searcher will filter by language",
	"category-searcher-placeholder": "Placeholder text displayed to indicate the ZIM file searcher will filter by category",
	"content-type-searcher-placeholder": "Placeholder text displayed to indicate the ZIM file searcher will filter by content type",
	"no-details": "A content type for ZIM files representing it only has an introduction.",
	"no-pictures": "A content type for ZIM files that does not contain pictures.",
	"no-videos": "A content type for ZIM files that does not contain videos.",
	"open-previous-tabs-at-startup": "The tabs that were open when the user closed the application is opened again when the application is restarted.",
	"preview-book-in-web-browser": "Preview this book by opening the link to its preview website in the native web browser",
	"file-not-found-title": "Error title text displayed when the desktop application cannot find the ZIM file needed to display the web page.",
	"file-not-found-text": "Error description text for when the desktop application cannot find the ZIM file needed to display the web page.",
	"zim-id": "The term for the unique identifier of a ZIM file.",
	"zim-name": "The term for the name of a ZIM file",
	"zim-path": "The term for the path of a ZIM file",
	"bad-zim-file-error-page-title": "Error title text displayed when the ZIM file appears to be invalid or corrupted",
	"bad-zim-file-error-page-text": "Error description text displayed when the ZIM file appears to be invalid or corrupted",
	"zim-entry-path": "The term for the path of an entry inside a ZIM file",
	"export-reading-list": "Represents the action of exporting the reading list to a file.",
	"export-reading-list-error": "Error description text for when exporting the reading list to a file failed.",
	"import-reading-list": "Represents the action of importing a reading list from a file.",
	"import-reading-list-error": "Error description text for when importing a reading list from a file failed.",
	"disable-sandbox": "Question description text for when disabling the sandbox feature (Windows network drive), asking the user if he wants to proceed.",
	"save-page-as": "Represents the action of saving the current tab content to a file chosen by the user.",
	"portable-disabled-tooltip": "Tooltip used to explain disabled components in the portable version.",
	"scroll-next-tab": "Represents the action of scrolling to the next tab of the current tab which toward the end of the tab bar.",
	"scroll-previous-tab": "Represents the action of scrolling to the previous tab of the current tab which toward the start of the tab bar."
}
